[{"author_name": "Gordon M.", "author_location": "Vancouver, Canada", "author_friends": 0, "author_reviews": 1, "rating": 4, "review_date": "Aug 12, 2024", "review_text": "Erika and Andrea did an  excellent job cleaning my place.  They did everything I asked and more.  I will  definitely ask for them again.", "helpful_count": 0, "thanks_count": 0, "love_count": 0, "oh_no_count": 0}, {"author_name": "Cindy G.", "author_location": "Vancouver, Canada", "author_friends": 0, "author_reviews": 3, "rating": 4, "review_date": "Jun 21, 2024", "review_text": "Jannette and Andrea are Best... They did an amazing job. My second time using this team at Kirei and I will be back. thank you", "helpful_count": 0, "thanks_count": 0, "love_count": 0, "oh_no_count": 0}, {"author_name": "Ankur S.", "author_location": "Fairview, Vancouver, Canada", "author_friends": 0, "author_reviews": 1, "rating": 4, "review_date": "May 29, 2024", "review_text": "Got a move out service done from them recently but was disappointed by the level of service. They mostly cleaned the things that were in plain sight if you're doing a cursory scroll of the apartment but left lot of cobwebs and dust near the corners. Earlier, they mentioned it takes 3 hours but they came late and left little earlier. Wouldn't recommend them for move out unless your landlord have eyesight issues.", "helpful_count": 1, "thanks_count": 0, "love_count": 0, "oh_no_count": 0}, {"author_name": "Shen G.", "author_location": "Sunset, Vancouver, Canada", "author_friends": 0, "author_reviews": 1, "rating": 4, "review_date": "Sep 26, 2023", "review_text": "I've never had to write a negative review until now, but my recent experience with their move-out cleaning service and my subsequent attempt to address the issue with them were completely unacceptable. I feel compelled to share my experience.Based on my research prior to booking, I understood that professional move-out cleaning should encompass a thorough cleaning of every nook and cranny in your home or apartment. This typically includes sanitizing high-traffic surfaces in the bathrooms and kitchen, cleaning all windows, deep cleaning cabinets, drawers, countertops, and appliances. All with the end goal of smooth move-out inspection and transition. However, the cleaning team missed an entire cabinet, which was left in the same condition as when we vacated (see pic 1). They also neglected to clean the interior windows, the patio door, and even the balcony (see pic 2). These areas are considered accessible per strata bylaws therefore must be cleaned before moving out.We paid a premium for their carpet steam cleaning service, but the results were disappointing. Not only were there dust and dirt left in the corners of the room, but they were also visibly present on the front surface of the carpets (see pic 3). When we messaged them to raise this issue, their response was shockingly dismissive: \"place in unlivable condition, 7 garbage bags, no touch-ups.\" They even attached a photo from their cleaning, apparently thinking it justified their poor job. It's important to note that their services were paid by the hour, not by the amount of garbage bags used throughout the cleaning -- which summed up to an excessive $600 + tips for 3 hours of cleaning.At the very least, they should consider removing the line \"No matter the type of building or business, or size of the mess, we can help\" from their website because apparently, handling 7 garbage bags for a move-out cleaning is beyond their capabilities. I also need to mention that they've left the garbage bags inside the unit -- and I was the one who at the end had to dispose of them myself. Lastly, all of these were contained in the kitchen area and by no means rendered the place unlivable. I've attached the picture they sent us when they referred to our place as \"unlivable\" (see pic 4), allowing you to judge for yourself if that's truly the case. Also, this issue has nothing to do with the poor steam carpet cleaning and their overall lack of attention to detail in other parts of the unit. We're absolutely displeased with their horrible communication and apparent lack of concern.In the end, we booked another cleaning company that did a far superior job at a fraction of the price, leaving us satisfied. For these reasons, I cannot, in good conscience, give them more than 1 star. We aren't happy. They've left us with more frustration than cleanliness, and my money would have been better spent elsewhere.", "helpful_count": 5, "thanks_count": 0, "love_count": 0, "oh_no_count": 4}, {"author_name": "G D.", "author_location": "Central, Vancouver, Canada", "author_friends": 0, "author_reviews": 1, "rating": 4, "review_date": "Sep 1, 2023", "review_text": "The Kirei team includes kind people, who are skilled at keeping our home clean on a weekly basis and we are grateful for their help", "helpful_count": 0, "thanks_count": 0, "love_count": 0, "oh_no_count": 0}, {"author_name": "Holly M.", "author_location": "Vancouver, Canada", "author_friends": 0, "author_reviews": 5, "rating": 4, "review_date": "Aug 17, 2023", "review_text": "We used Kirei for our move-out clean as our realtor recommended them to us. We were thrilled with the quality of their work it was excellent. We are sopleased knowing we are leaving our condo sparkling clean for the new owner.I would highly recommend Kirei.", "helpful_count": 0, "thanks_count": 0, "love_count": 0, "oh_no_count": 0}, {"author_name": "Charmaine M.", "author_location": "Vancouver, Canada", "author_friends": 0, "author_reviews": 2, "rating": 4, "review_date": "Jul 5, 2023", "review_text": "Antonia and Jannette cleaned my condo yesterday.  I moved in on Friday and the place was left very dirty.  I provided them a list and they did everything.  It was a deep clean and they were here for four hours (I thought it would take more time).  They arrived  on-time and are experts on cleaning and very professional and friendly.  I am so happy In addition, a shout out to Julio for his very timely texts and squeezing me in and this was done during his time away from the office enjoying Canada Day.Thanks so much to all of you.  I highly recommend these two ladies and company for all of your cleaning needs.  Charmaine", "helpful_count": 0, "thanks_count": 0, "love_count": 0, "oh_no_count": 0}, {"author_name": "Amelia C.", "author_location": "Fairview, Vancouver, Canada", "author_friends": 0, "author_reviews": 1, "rating": 4, "review_date": "Jun 14, 2023", "review_text": "This is the third time that I've had Kirei do regular house cleaning. Jannette & Ann did a great job and I'd be happy to have them come again. I do wish the company provided them with a different type of vacuum cleaner though, as it doesn't get rid of the cat fur on my carpet. But overall a good job. Great ladies!", "helpful_count": 0, "thanks_count": 0, "love_count": 0, "oh_no_count": 0}, {"author_name": "BJ E.", "author_location": "South San Francisco, CA", "author_friends": 0, "author_reviews": 4, "rating": 4, "review_date": "Jun 4, 2023", "review_text": "I requested a move in cleaning from the team and I just wanted to share that the team was very accommodating and did a great job! Thanks so much! My new place felt 100 times better afterwards. I would absolutely use them again. In addition, their time estimate was spot on and the total cost was extremely budget friendly!", "helpful_count": 0, "thanks_count": 0, "love_count": 0, "oh_no_count": 0}, {"author_name": "Monika K.", "author_location": "West Vancouver, Canada", "author_friends": 0, "author_reviews": 6, "rating": 4, "review_date": "Feb 1, 2023", "review_text": "I don't like leaving negative reviews unless I truly have to. I hired this company on two occasions for the month of January. They charge $80 an hour and give you an estimate.Moving out of my old apartment while I was packing, I asked for help with my kitchen which was already mostly done.  the individuals who came  did not speak English nor trained either. As a result we could not communicate and the amount of time that it took me to explain what needed to be done and how it needed to be done was frustrating and a waste of time as in the end a total of half an hour work was accomplished. I still paid them for the minimum two hours. They were both very nice people and it wasn't their fault that they were not trained. they were sent on a job where communication was necessary.When I called to speak to the manager she said she did not know what had happened but that I would get a very serious team for my move out cleaning. I was given an estimate of three hours maximum for cleaning my apartment. The starting time was 9 o'clock the team arrived half an hour late and started 15 minutes later. At some point they had to go and move their car as it was being towed which took another few minutes. One of them was a very serious worker who cleaned the kitchen. The other person cleaned my living room and the bedrooms. They were done by 12:30 But I was billed from 9 to 2 PM for $450!The strata would have charged $300 for cleaning. The arriving late and moving their car, etc were all considered and counted into my bill. Not only they had not washed the floors nor wiped the doors which I had to do. All the dirt was pushed to the sides and the corners. The same with the bathroom floors and the windows. So the next day before handing over my keys, I had to go early in the morning and clean the apartment myself. What I find about this company is that they're taking on new people pairing them with experienced people without any training. The reviews were deceiving on yelp so were the promises. Not honest in their estimate nor hours of work. Unfortunately I do not and can NOT recommend them at all.", "helpful_count": 1, "thanks_count": 0, "love_count": 0, "oh_no_count": 0}, {"author_name": "N/A", "author_location": "N/A", "author_friends": 0, "author_reviews": 0, "rating": 0, "review_date": "N/A", "review_text": "N/A", "helpful_count": 0, "thanks_count": 0, "love_count": 0, "oh_no_count": 0}]
